# filename guess_my_number.py
# Отгадай число
#
# Компьютер выбирает случайное число в диапазоне от 1 до 100
# Игрок пытается отгадать это число, и компьютер говорит,
# предположение больше/меньше, чем загаданное число,
# или попал в точку
import random

print("Добро пожаловать в игру 'Отгадай число'!")
print("\nЯ загадал натуральное число из диапазона от 1 до 100.")
print("Постарайтесь отгадать его за минимальное число попыток.\n")

# начальные значения
the_number = random.randint(1, 100)
guess = int(input("Ваше прtдположение: "))
tries = 1

# цикл угадывания
while guess != the_number:
	if guess > the_number:
		print("Меньше...")
	else:
		print("Больше...")
	guess = int(input("Ваше предположение: "))
	tries += 1

print("Вам удалось отгадать число! Это в самом деле ", the_number)
print("Вы затратили на отгадывание всего лишь ", tries, "попыток!\n")
input("\nНажмите Ентер шобы выйти!") 