name = input('Имя клиента ')
numbers = input('Количество купленных путевок ')
turs = input('Предлагаемый тур ')

print('Имя клиента: {} Количество купленных путевок: {} Предалаемая путевка: {}'.format(name, numbers, turs))
print('Здравствуйте, {}. Вы путешествовали с нами уже {} раз(а)! Хотите снова?'.format(name, numbers))
print('Наша турфирма проводит распродажу. Тур в {} со скидкой 50%!'.format(turs))

#Имя клиента:
# Количество купленных путёвок:
# Предлагаемая путевка:
# Здравствуйте Вы путешествовали с нами уже ... раз(а)! Хотите снова?
# Наша турфирма проводит распродажу. Тур в ... со скидкой 50%!')