# fancy_credits.py
# Воображаемые благодарности
# Образец применения escape-последовательностей
print("\t\t\t\t\t\tВоображаемые благодарности")
print("\t\t\t \\ \\ \\ \\ \\ \\ \\")
print("\t\t\tразрабочтика игры")
print("\t\t\tМайкла Доусона")
print("\t\t\t \\ \\ \\ \\ \\ \\")
print("\n\n\nОтдельное спасибо хотелсь бы сказать: ")
print("моему парикмахеру Герни по прозвищу \'Великолепный\', который не знает слова \"невозможно\".")
# Звучить системный динамик
print("\a\a\a")
input("\nНажмите Enter, чтобы выйти.")