# filename silly_striпgs.ру

# Забавные строки
# Демонстрирует сцепление и повторение строк
print("Две строки можно " + "сцепить с помощью оператора '+'.")
print("\nЭто строка " + "вряд ли " + "удив" + "ит вас. " \
+ "Но интересно. " + "что" + " она - \n" + "одна длинная-длин" \
+ "на" + "я" + "строка. сцепленная " \
+ "из " + "двадцати двух\n" + "отдельных строк, разбитых "\
"на шесть строк. " + "Достаточно ли вы" + "впечатлены? " + "Ну хватит, \n" \
+ "вот " + "наша " + "длинная" + "строка и закончилась!")
print("\nЕсли текст нравится, его можно и повторить. К примеру, ")
print("кто не любит пироженых? Только дураки не любят пироженных. А")
print("раз люди честные, то выскажемся о своих симпатиях")
print("откровенно: ")
print("Приожные " * 10)
input("\n\nНажмите Enter, чтобы выйти. ")