# filename word_problems.py

# Текстовые задачи
# Демонстрирует математические операции
print("Если беременная самка бегемота массой 800 кг родит детеныша массой 40 кг. ")
print("но затем съест 20 кг корма, то сколько она будет после этого весить?")
input("Чтобы узнать, нажмите Enter.")
print("800 - 40 + 20 =", 800-40+20)
print("\nЕсли студент, возвращаясь с успешно сданного экзамена, на радостях")
print("купил каждому из 6 друзей по 3 бутылки пива, то сколько всего бутылок пива куплено?")
input("Чтобы узнать, нажмите Enter.")
print("6*3=", 6*3)
print("\nЕсли в ресторане вам с приятелем принесли счет на 19 долларов (считая\
	чаевые).")
print("и вы решили скинуться поровну на четверых, то сколько придется с каждого?")
input("Чтобы узнать ответ нажмите Enter.")
print("19/4 = ", 19 / 4)

print("107 // 4 =", 107 // 4)
print("107 % 4 =", 107 % 4)
input("Чтобы выйти, нажмите Enter.")
